
/*
Homework 3 - JavaScript
Task - 2
Ivelin Lungarov

Задача 2: Дадени са текст и списък от думи, разделени със запетайка.
 Списъкът описва думи, които са нецензурни и не трябва да се 
 съдържат в текста. Напишете програма, която замества всички 
 нецензурни думи от текста със звездички. Например ако имаме 
 текста "Какъв хикс дириш тука бе менте?" и списък с нецензурни 
 думички "менте, хикс", програмата трябва да го преработи така: 
 "Какъв **** дириш тука бе *****?". 
*/

"use strict"



var allWords = ['Какъв', 'хикс', 'дириш', 'тука', 'бе', 'миндил', '?'];

var badWords = ['хикс', 'менте']; 


for (var i = 0; i < allWords.length; i++) {
	if (allWords[i] == 'хикс') {
		allWords[i] = '****';
	}
}

for (var index = 0; index < allWords.length; index++) {
	if (allWords[index] == 'миндил') {
		allWords[index] = '******';
	}
}

console.log(allWords);



