
/*
Lecture 3 
Homework Task 1
Ivelin Lungarov

Да се изведат съобщения към потребителя и да се прочетат две числа 
от клавиатурата A и B (може да са с плаваща запетая). 
После да се прочете трето число C и да се провери дали 
то е между A и B. Да се изведе подходящо съобщение в конзолата 
за това дали C е между A и B. 
*/
		
	var a = 15.9;
	var b = 2981.5;
	var c = 101.1;

	console.log(a);
	console.log(b);
	console.log(c);

	console.log(c > a && c < b ? 'Числото 101.1 е между 15.9 и 2981.5' : 'Try Again');
