/* Student: Albena Indzheva
 * 
 * Въведете три стойности от клавиатурата – час(целочислен тип), сума пари(число с плаваща запетая), дали съм здрав(булев тип). Съставете програма, която взема решения на базата на тези данни по следния начин: 
 * - ако съм болен няма да излизам 
 * - ако имам пари ще си купя лекарства 
 * - ако нямам – ще стоя вкъщи и ще пия чай 
 * - ако съм здрав 
 * - ако имам по-малко от 10 лв ще отида на кафе и т.н. 
 * Полученото решение покажете като съобщение в конзолата.
*/

var hour = prompt("Въведете ЧАС (целочислено число):");
hour = parseInt(hour);
var money = prompt("Въведете ПАРИ (число с плаваща запетая):");
money = parseFloat(money);
var healthy = prompt("Здрав ли съм ('да' или 'не')").toLowerCase();

if (healthy == "да") {
 healthy = true;
}

if (healthy == "не") {
 healthy = false;
}

if (healthy == false) {
	console.log("Болен съм, няма да излизам.");
	if (money > 10) {
		console.log("Имам повече от 10 лв, ще си купя лекарства.");
	} else {
		console.log("Няма да ми стигнат парите, ще стоя вкъщи и ще пия чай.");
	}

} else {
	console.log("Здрав съм.");
	if ((money < 10) && (money > 0)) {
		console.log("Имам по-малко от 10 лв, ще отида на кафе.");
	} else if (money > 10) {
		if ((hour < 18) && (hour > 8)) {
			console.log("Имам повече от 10 лв, още е ден, отивам на басейн");
		}
		if ((hour > 18) && (hour < 24)) {
			console.log("Имам повече от 10 лв, вечер е, отивам на ресторант");
		}
		
	}
}