
/*
Lecture 3 
Homework - Task 2
Ivelin Lungarov

Да се изведат съобщения към потребителя и да се прочетат две 
целочислени числа от клавиатурата A и B. Запишете тяхната сума, 
разлика, произведение и остатък от деление в отделни променливи и 
разпечатайте тези резултати в конзолата. 
Опитайте същото с числа с плаваща запетая. 
*/
		

var A = 5;
var B = 2.5;


console.log('Сумата от A + B е' + ' ' + (A + B));
console.log('Разликата между A - B е' + ' ' + (A - B));
console.log('Произведението на A * B е' + ' ' + (A * B));
console.log('Остатъкът от деление на A и B е' + ' ' + (A % B));
